Revit 2017 API
AssetProperties.Item Property (String)
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public AssetProperty this[
	string name
] { get; }
Visual Basic
Public ReadOnly Default Property Item ( _
	name As String _
) As AssetProperty
	Get
Visual C++
public:
property AssetProperty^ default[String^ name] {
	AssetProperty^ get (String^ name);
}
Parameters
name
Type: System.String
See Also
AssetProperties Class
Item Overload
Autodesk.Revit.Utility Namespace